<footer class="bg-base-300 text-base-300-content p-10">
    <div
        class="footer sm:footer-horizontal container mx-auto max-md:grid-cols-2 max-sm:grid-cols-1 max-sm:justify-items-center">
        <aside>
            <div>
                <a href="#">
                    <x-small-logo class="mx-auto px-5 pb-3" background="var(--color-base-300)" pieces="black"
                        primary="black" secondary="#FFFF00" />
                </a>
                <p class="text-center">
                    <i>СІКШ</i>
                    <br />
                    <strong>«ХІД КОРОЛЕВИ»</strong>
                    <br />
                    <span>з 2021 року</span>
                </p>
            </div>
            {{-- --}}
            <nav class="my-4 hidden w-full max-lg:block">
                <div class="grid grid-flow-col gap-4">
                    <a href="#">
                        <svg xmlns="http://www.w3.org/2000/svg" width="24" height="24" viewBox="0 0 24 24"
                            class="fill-current">
                            <path
                                d="M24 4.557c-.883.392-1.832.656-2.828.775 1.017-.609 1.798-1.574 2.165-2.724-.951.564-2.005.974-3.127 1.195-.897-.957-2.178-1.555-3.594-1.555-3.179 0-5.515 2.966-4.797 6.045-4.091-.205-7.719-2.165-10.148-5.144-1.29 2.213-.669 5.108 1.523 6.574-.806-.026-1.566-.247-2.229-.616-.054 2.281 1.581 4.415 3.949 4.89-.693.188-1.452.232-2.224.084.626 1.956 2.444 3.379 4.6 3.419-2.07 1.623-4.678 2.348-7.29 2.04 2.179 1.397 4.768 2.212 7.548 2.212 9.142 0 14.307-7.721 13.995-14.646.962-.695 1.797-1.562 2.457-2.549z">
                            </path>
                        </svg>
                    </a>
                    <a href="#">
                        <svg xmlns="http://www.w3.org/2000/svg" width="24" height="24" viewBox="0 0 24 24"
                            class="fill-current">
                            <path
                                d="M19.615 3.184c-3.604-.246-11.631-.245-15.23 0-3.897.266-4.356 2.62-4.385 8.816.029 6.185.484 8.549 4.385 8.816 3.6.245 11.626.246 15.23 0 3.897-.266 4.356-2.62 4.385-8.816-.029-6.185-.484-8.549-4.385-8.816zm-10.615 12.816v-8l8 3.993-8 4.007z">
                            </path>
                        </svg>
                    </a>
                    <a href="#">
                        <svg xmlns="http://www.w3.org/2000/svg" width="24" height="24" viewBox="0 0 24 24"
                            class="fill-current">
                            <path
                                d="M9 8h-3v4h3v12h5v-12h3.642l.358-4h-4v-1.667c0-.955.192-1.333 1.115-1.333h2.885v-5h-3.808c-3.596 0-5.192 1.583-5.192 4.615v3.385z">
                            </path>
                        </svg>
                    </a>
                </div>
            </nav>
            {{-- --}}
        </aside>
        <nav class="max-lg:hidden">
            <h6 class="footer-title">СОЦІАЛЬНІ МЕРЕЖІ</h6>
            <div class="grid grid-flow-col gap-4">
                <a href="#">
                    <svg xmlns="http://www.w3.org/2000/svg" width="24" height="24" viewBox="0 0 24 24"
                        class="fill-current">
                        <path
                            d="M24 4.557c-.883.392-1.832.656-2.828.775 1.017-.609 1.798-1.574 2.165-2.724-.951.564-2.005.974-3.127 1.195-.897-.957-2.178-1.555-3.594-1.555-3.179 0-5.515 2.966-4.797 6.045-4.091-.205-7.719-2.165-10.148-5.144-1.29 2.213-.669 5.108 1.523 6.574-.806-.026-1.566-.247-2.229-.616-.054 2.281 1.581 4.415 3.949 4.89-.693.188-1.452.232-2.224.084.626 1.956 2.444 3.379 4.6 3.419-2.07 1.623-4.678 2.348-7.29 2.04 2.179 1.397 4.768 2.212 7.548 2.212 9.142 0 14.307-7.721 13.995-14.646.962-.695 1.797-1.562 2.457-2.549z">
                        </path>
                    </svg>
                </a>
                <a href="#">
                    <svg xmlns="http://www.w3.org/2000/svg" width="24" height="24" viewBox="0 0 24 24"
                        class="fill-current">
                        <path
                            d="M19.615 3.184c-3.604-.246-11.631-.245-15.23 0-3.897.266-4.356 2.62-4.385 8.816.029 6.185.484 8.549 4.385 8.816 3.6.245 11.626.246 15.23 0 3.897-.266 4.356-2.62 4.385-8.816-.029-6.185-.484-8.549-4.385-8.816zm-10.615 12.816v-8l8 3.993-8 4.007z">
                        </path>
                    </svg>
                </a>
                <a href="#">
                    <svg xmlns="http://www.w3.org/2000/svg" width="24" height="24" viewBox="0 0 24 24"
                        class="fill-current">
                        <path
                            d="M9 8h-3v4h3v12h5v-12h3.642l.358-4h-4v-1.667c0-.955.192-1.333 1.115-1.333h2.885v-5h-3.808c-3.596 0-5.192 1.583-5.192 4.615v3.385z">
                        </path>
                    </svg>
                </a>
            </div>
        </nav>
        <nav class="max-lg:order-2">
            <h6 class="footer-title inline-block max-sm:mx-auto">Legal</h6>
            <a href="#" class="link link-hover">Умови використання</a>
            <a href="#" class="link link-hover">Політика конфіденційності</a>
            <a href="#" class="link link-hover">Cookies</a>
        </nav>
        <div>
            <h6 class="footer-title inline-block max-sm:mx-auto">Контакти</h6>
            <div class="mb-2">
                <svg class="inline h-5" viewBox="-4 0 36 36" xmlns="http://www.w3.org/2000/svg"
                    xmlns:xlink="http://www.w3.org/1999/xlink">
                    <title>map-marker</title>
                    <desc>Created with Sketch.</desc>
                    <defs>
                    </defs>
                    <g id="Vivid.JS" stroke="none" stroke-width="1" fill="none" fill-rule="evenodd">
                        <g id="Vivid-Icons" transform="translate(-125.000000, -643.000000)">
                            <g id="Icons" transform="translate(37.000000, 169.000000)">
                                <g id="map-marker" transform="translate(78.000000, 468.000000)">
                                    <g transform="translate(10.000000, 6.000000)">
                                        <path
                                            d="M14,0 C21.732,0 28,5.641 28,12.6 C28,23.963 14,36 14,36 C14,36 0,24.064 0,12.6 C0,5.641 6.268,0 14,0 Z"
                                            id="Shape" fill="#ff4646">
                                        </path>
                                        <circle id="Oval" fill="#590000" fill-rule="nonzero" cx="14"
                                            cy="14" r="7">
                                        </circle>
                                    </g>
                                </g>
                            </g>
                        </g>
                    </g>
                </svg>
                <a class="link" href="https://maps.app.goo.gl/Dbb1h2Uetaz2zxRB8">
                    м. Васильків, вул. Декабристів, 777
                </a>
            </div>
            <div class="mb-2">
                <svg class="inline h-6" viewBox="50 0 1000 1000" xmlns="http://www.w3.org/2000/svg">
                    <path
                        d="M566.731034 123.586207C347.806897 123.586207 171.255172 301.903448 171.255172 519.062069c0 218.924138 178.317241 395.475862 395.475862 395.475862 218.924138 0 395.475862-178.317241 395.475863-395.475862C962.206897 301.903448 785.655172 123.586207 566.731034 123.586207zM812.137931 709.737931c-10.593103 35.310345-58.262069 86.510345-102.4 86.510345L706.206897 794.482759c-65.324138-3.531034-155.365517-65.324138-238.344828-165.958621l-30.013793-37.075862c-82.97931-100.634483-127.117241-199.503448-116.524138-263.062069 7.062069-45.903448 74.151724-82.97931 112.993103-82.97931 19.42069 0 26.482759 8.827586 28.248276 15.889655 21.186207 38.841379 49.434483 105.931034 49.434483 130.648276v3.531034c-5.296552 12.358621-15.889655 19.42069-24.717241 24.717241-12.358621 7.062069-19.42069 12.358621-21.186207 24.717242 0 3.531034 3.531034 22.951724 58.262069 90.041379l22.951724 28.248276c54.731034 65.324138 72.386207 72.386207 75.917241 72.386207 14.124138 1.765517 19.42069-3.531034 30.013793-14.124138 7.062069-8.827586 15.889655-17.655172 28.248276-19.42069h3.531035c24.717241 5.296552 84.744828 44.137931 120.055172 74.151724 5.296552 1.765517 14.124138 10.593103 7.062069 33.544828z m0 0"
                        fill="#3164AF" />
                </svg>
                <a class="link inline" href="tel:+380998887766">
                    +380 99 888 77 66
                </a>
                (адміністратор)
            </div>
            <div class="mb-2">
                <svg class="inline h-5" fill="#FA5252" xmlns="http://www.w3.org/2000/svg" viewBox="-5 0 60 50">
                    <path
                        d="M 5.5 7 C 3.019531 7 1 9.019531 1 11.5 L 1 11.925781 L 25 29 L 49 11.925781 L 49 11.5 C 49 9.019531 46.980469 7 44.5 7 Z M 6.351563 9 L 43.644531 9 L 25 22 Z M 1 14.027344 L 1 38.5 C 1 40.980469 3.019531 43 5.5 43 L 44.5 43 C 46.980469 43 49 40.980469 49 38.5 L 49 14.027344 L 43 18.296875 L 43 41 L 7 41 L 7 18.296875 Z" />
                </svg>
                <a class="link" href="mailto:khid-korolevy@email.com">
                    khid-korolevy@email.com
                </a>
            </div>
        </div>
    </div>
</footer>
