    <main class="container mx-auto mt-7 lg:flex">
        <section class="grow-3 lg:mr-10">
            <div class="format lg:card-side bg-base-100 static mb-5 mt-5 w-full rounded-lg px-4 py-5 shadow-sm">

                <p><span style="font-weight: bold;">Шановні гравці та шанувальники шахів!</span></p>
                <p>Шаховий клуб <span style="font-weight: bold;">[Назва клубу]</span> запрошує всіх охочих взяти участь у
                    <span style="font-weight: bold;">відкритому турнірі "Король дошки"</span>, який відбудеться <span
                        style="font-weight: bold;">[дата]</span> за адресою <span style="font-weight: bold;">[місце
                        проведення]</span>.
                </p>
                <p><span style="font-weight: bold;">Формат турніру:</span></p>
                <ul>
                    <li>
                        <p>5 турів за швейцарською системою</p>
                    </li>
                    <li>
                        <p>Контроль часу: <span style="font-weight: bold;">[наприклад, 15 хвилин на партію + 5 секунд за
                                хід]</span></p>
                    </li>
                    <li>
                        <p>Розіграш призових місць та спеціальних номінацій</p>
                    </li>
                </ul>
                <p><span style="font-weight: bold;">Реєстрація:</span><br>Для участі необхідно заповнити форму до <span
                        style="font-weight: bold;">[дата]</span> за посиланням: <span
                        style="font-weight: bold;">[посилання]</span>. Кількість місць обмежена!</p>
                <p><span style="font-weight: bold;">Призи:</span></p>
                <ul>
                    <li>
                        <p>🏆 <span style="font-weight: bold;">1 місце:</span> Головний трофей + <span
                                style="font-weight: bold;">[нагорода]</span></p>
                    </li>
                    <li>
                        <p>🥈 <span style="font-weight: bold;">2-3 місця:</span> Медалі та подарунки від партнерів</p>
                    </li>
                    <li>
                        <p>🎯 <span style="font-weight: bold;">Спеціальна номінація:</span> "Найкраща комбінація
                            турніру"</p>
                    </li>
                </ul>
                <p>Турнір – це чудова можливість випробувати свої сили, зустрітися з однодумцями та отримати незабутні
                    враження!</p>
                <p><span style="font-weight: bold;">Не проґавте шанс стати Королем дошки!</span> 👑♟️</p>
                <p><em>Деталі за телефоном: <span style="font-weight: bold;">[номер]</span>.<br>Офіційна сторінка події:
                        <span style="font-weight: bold;">[посилання на соцмережі/сайт]</span>.</em></p>

            </div>
            <x-blocks.submit-buttons />
        </section>
        <x-blocks.sidebar.right />
    </main>
